package com.xingyun.utility;

import java.util.ArrayList;

import com.xingyun.entity.Dish;
import com.xingyun.entity.DishType;
import com.xingyun.entity.Event;

public class WSUtility {
	public static Event getEventDetailInfo(int index) {
		Event evt = new Event();

		evt.setImageUrl("");
		evt.setTitle(index + "小份菜 大味道");
		evt.setDescription(index
				+ "小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n小份菜 大味道 小份菜 大味道 小份菜 大味道 小份菜 大味道 \n\n小份菜 大味道 ");

		return evt;
	}

	public static ArrayList<Dish> getDishes(DishType type) {
		ArrayList<Dish> dishes = new ArrayList<Dish>();

		for (int i = 0; i < 30; i++) {
			Dish dish = new Dish("dish" + i, i, "http://www.baidu.com/img/shouye_b5486898c692066bd2cbaeda86d74448.gif");
			dishes.add(dish);
		}

		return dishes;
	}
}
